Add datamodel, update domain model
