--- a/docs/domain/domain-model.md
+++ b/docs/domain/domain-model.md
@@ -7,73 +7,126 @@ title: Domain Model
 when the tour is synchronized.
 :::
 
-```mermaid
-classDiagram
-    class User {
-        username
-        password
-        
-        getTours()
-        getTour(id)
-        createTour()
-        editTour()
-        deleteTour()
-    }
-    class Tour {
-        description
-        category
-        date
-    }
-    class Image {
-        id
-    }
-    class Waypoint {
-        latitude
-        longitude
-        name
-    }
-    class Role {
-        name
-        moderateUsers()
-    }
-    
-    User "*" -- "1" Role : is
-    User "1" -- "*" Tour : documents
-    Tour "1" *-- "*" Image : may contain
-    Tour "1" *-- "2" Waypoint : has   
-    Image "1" *-- "0..1" Waypoint : may have   
+```plantuml Domain
+@startuml
+class User {
+  email
+  password
+  getTours()
+  getTour(id)
+  createTour()
+  editTour()
+  deleteTour()
+}
+
+class Role{
+  name
+  moderateUsers()
+}
+
+class Tour {
+  title
+  description
+  password
+}
+
+class Category{
+  title
+}
+
+abstract class UserUpload {
+  id
+  storageIdentifier
+}
+
+class Image {}
+class GPXTrack{}
+
+class Waypoint{
+  latitude
+  longitude
+}
+
+class GPXTrack {}
+
+User "1" -- "*" Tour: documents
+
+User "*" - "1" Role: is
+
+Tour "*" -- "1..*" Category: belongs to
+
+Tour "1" *- "*" Image: may contain
+
+Image "1" *-- "0..1" Waypoint: may have
+
+Tour "1" *- "2" Waypoint: has
+
+Tour "1" *- "0..1" GPXTrack: may contain
+
+UserUpload <|-- Image
+UserUpload <|-- GPXTrack
+
+User "1" - "*" UserUpload: may have
+@enduml
 ```
 
 ## `User`
 
